from sense_hat import SenseHat
from time import sleep

s = SenseHat()

while True:
    # Η accel_raw επιστρέφει ένα λεξικό με
    # τα ονόματα των αξόνων και τις τιμές τους.
    a = s.accel_raw

    # Για να αντλήσουμε την τιμή από κάθε άξονα σε ξεχωριστή μεταβλητή
    # ακολουθούμε την παρακάτω σύνταξη:
    x = a['x']
    y = a['y']
    z = a['z']
    # Tο a είναι το λεξικό μας. Το όνομα της τιμής που θέλουμε να αντλήσουμε
    # βρίσκεται μέσα σε μονά εισαγωγικά και σε τετράγωνες αγκύλες και
    # το τοποθετούμε δίπλα στο λεξικό μας.

    # Με τη round στρογγυλοποιούμε κάθε τιμή στον πλησιέστερο ακέραιο.
    x=round(x, 0)
    y=round(y, 0)
    z=round(z, 0)
	
    # Εμφανίζουμε τις τιμές στην κονσόλα (shell) της python.
    print("x=",x," y=",y," z=",z)

    sleep(0.1)